catalog=[{
	"Title": "Introduction to 3D Printing",
	"Category": "3D Printing and Modeling",
	"Age": "9 to 14",
	"Time": "Full-day",
	"Prereq": "None",
	"Description": "You will make your own 3D creations. Your ideas will pop out of your head into your hands! Student will learn how to use a professional software to sculpt, texture, arrange and render their own 3D projects. This class will be more focus on the 3D modeling than the 3D printing. We will show students how to order online the 3D objects in their projects. ",
	"Notes": "The software used in this class has more functionalities and is more robust that the simple 3D modeling software in the ",
	"Status": "NEW",
	"Img":"intro3dprint.png"
}, {
	"Title": "3D Modeling and Printing",
	"Category": "3D Printing and Modeling",
	"Age": "9 to 14",
	"Time": "Full-day",
	"Prereq": "None",
	"Description": "Welcome to 3D printing - the technology that will change the way we live! You will learn about different 3D printing methods, materials, and software. The instructor will guide the students in creating 3D models using simple design software that are free, accessible and easy to learn. At the completion of the course, every student will have at least one 3D object from their projects to take home. We will show students how to how to order any of the objects from their portfolio online. ",
	"Notes": "The modeling software will be available for free. Students' projects, resource files, and software will be available for download from our website.",
	"Status": "NEW",
	"Img":"3dmodelprint.png"
}, {
	"Title": "Legomation",
	"Category": "Animation",
	"Age": "6 and 7",
	"Time": "Half-day",
	"Prereq": "None",
	"Description": "LEGO® and animation …. Legomation! Using LEGO® minifigs and bricks,  webcam and computer software, students produce stop-motion animated movies. Instructor will guide the students to storyboard, animate and edit the movie. This is a great class to take with friends.  You can take it as many times as you like.",
	"Notes": "",
	"Status": "NEW",
	"Img":"legomation.png"
}, {
	"Title": "Brickfilms (previously Make-a-Movie)",
	"Category": "Animation",
	"Age": "8 and up",
	"Time": "Half-day",
	"Prereq": "None",
	"Description": "Lights…Camera…Action! Students’ dream of having their favorite LEGO® characters come to life become a reality in our movie making class. Using stop-motion animation and digital post-production editing, students produce LEGO® Brickfilms much like the ones viewed on YouTube. Students learn about developing creative storytelling techniques, incorporating visual and audio special effects. This is a great class to take with friends. Students can take the class as many times as they like. ",
	"Notes": "",
	"Status": ""
}, {
	"Title": "3D Animation",
	"Category": "Animation",
	"Age": "9 and up",
	"Time": "Full-day",
	"Prereq": "None",
	"Description": "Create your own 3D animated movie, like the movies on the big screen! Students start with a completely static scene and bring it to life using a 3D animation software tool. In the process, students will learn the fundamentals of moving objects in a 3D space, animating characters, and editing keyframes along a timeline. Not only the students will come away with an impressive project, but also with a foundational knowledge of a professional skill. ",
	"Notes": "",
	"Status": ""
}, {
	"Title": "Digital Filmmaking",
	"Category": "Animation",
	"Age": "10 and up",
	"Time": "Half-day",
	"Prereq": "Ability to work on a team",
	"Description": "oin the filmmaking elite as you work in teams to plan, script, stage, shoot and produce your own mini-movie.  Explore and create the scenes with the various stop motion styles such as claymation, puppet animation, cut-out animation, pixilation and various object animation. Learn video editing features such as green screen, video overlays, voice-overs, narration, animated titles and credits and many more. This is a great class to take with friends.",
	"Notes": "",
	"Status": "NEW"
}, {
	"Title": "App Design",
	"Category": "App Development",
	"Age": "9 and up",
	"Time": "Full-day",
	"Prereq": "Experience with computers",
	"Description": "You will learn how to create your own mobile game app using Multimedia Fusion , a powerful software development kit, to program and design your apps. You will learn both principles of design and development skills. Students start with a blank white screen, but by the end of course, they will have a professional-quality app on their iPod touch®,  iPhone® or iPad®.",
	"Notes": "",
	"Status": ""
}, {
	"Title": "Kid Pix Inspiration",
	"Category": "Digital Graphics",
	"Age": "6 and 7",
	"Time": "Half-day",
	"Prereq": "None",
	"Description": "In this class, you will let your imagination fly while creating fun computer art projects. This class teaches the software Kid Pix, which includes many intriguing features like music, stickers, paint, letters, and animated characters. Children in this class will be having a blast while learning basic technical skills and building self-confidence!",
	"Notes": "",
	"Status": ""
}, {
	"Title": "Crafty Graphic Design",
	"Category": "Digital Graphics",
	"Age": "8 and up",
	"Time": "Half-day",
	"Prereq": "None",
	"Description": "This course will inspire the students to discover their inner-crafter, and create customized gifts Students will design graphics to be printed on various products, and go home with their finished projects. The design skills learnt from these projects are transferable to many other products. Some samples products are greeting cards, buttons, magnets, keychains, bookmarks, bags, mousepads and tshirts.",
	"Notes": "",
	"Status": ""
}, {
	"Title": "Cartoonize Me!",
	"Category": "Digital Graphics",
	"Age": "8 and up",
	"Time": "Half-day",
	"Prereq": "None",
	"Description": "Does your child have a great idea for a comic book or a graphic novel? Students will have fun turning photos of their friends and themselves into the cartoons and being the stars of a comic story. They will create comics using a web camera, photo-editing software, images and templates. Student will learn photo editing software techniques such as converting photos into cartoons, creating background images, adding lighting, editing text bubbles and many more. The important skills of thinking through a storyline; planning and creating the characters; and writing a plot with dialogue; are all taught in an exciting and stimulating environment.",
	"Notes": "",
	"Status": "NEW"
}, {
	"Title": "Kodu Game Lab &reg;",
	"Category": "Game Design",
	"Age": "8 and up",
	"Time": "Half-day",
	"Prereq": "None",
	"Description": "Microsoft’s Kodu gives users control of powerful programming tools using simple graphical commands. Students will create 3-D worlds, add characters, and then make them interact or complete tasks. They will learn the different logic required if their character is on land, in the air, or under water.  Students will also program scoring, spawning characters, enemy objects, timers, health and various game levels. Based on “when something happens”, “do something” logic, students analyze problems and structure their solutions.",
	"Notes": "Students’  projects and resource files will be available for download 48 hours after the completion of the course.",
	"Status": ""
}, {
	"Title": "Game Creation - Arcade",
	"Category": "Game Design",
	"Age": "8 and up",
	"Time": "Half-day",
	"Prereq": "Experience with computers",
	"Description": "Students create their own customized functional arcade-style using Game Maker &reg; software. This class will create game elements such as the player, enemies, bonuses, levels, lives, and program object movements. In addition to having fun and gaining a sense of accomplishment, students learn about programming logic, drag-and-drop programming; logical functions such as repeat loops, conditional statements and variables.",
	"Notes": "Students’  projects and resource files will be available for download 48 hours after the completion of the course.",
	"Status": ""
}, {
	"Title": "Game Creation - Pacman Mazes",
	"Category": "Game Design",
	"Age": "8 and up",
	"Time": "Half-day",
	"Prereq": "Experience with computers",
	"Description": "PacMan is among one of the most popular arcade-style video games that appeas to young and old, as well as both genders. Students will create maze games that will focus on the strategies for good quality games for the appropriate age and difficulty level.  In additional to implementing strategies, and learning the basic software skills , students will learn about designing a splash page, changing sprite during the game, reversing directions, moving to new level based on scores.",
	"Notes": "Students’  projects and resource files will be available for download 48 hours after the completion of the course.",
	"Status": ""
}, {
	"Title": "Advanced Game Maker - Platform",
	"Category": "Game Design",
	"Age": "8 and up",
	"Time": "Half-day",
	"Prereq": "Experience with GameMaker &reg;",
	"Description": "Learn the foundation of platform games such as the classic Super Mario and Sonic the Hedgehog. Students will examine gravity, drawbridges, platforms, bosses, levels, effects, and learn how to keep expanding their skills on game design as well as programming logic. ",
	"Notes": "Students’  projects and resource files will be available for download 48 hours after the completion of the course.",
	"Status": ""
}, {
	"Title": "Advanced Game Maker - RPG (Role Playing Game)",
	"Category": "Game Design",
	"Age": "8 and up",
	"Time": "Half-day",
	"Prereq": "Experience with GameMaker &reg;",
	"Description": "You will learn to create a role playing game (RPG). Through the creation of a fantasy game, students will learn about level design, projectiles, enemy behavior, special effects, and narratives in the context of a game. Students will expand their creativity, and technical knowledge to create a game of larger scale and more depth.",
	"Notes": "Students’  projects and resource files will be available for download 48 hours after the completion of the course.",
	"Status": "UPDATED"
}, {
	"Title": "3D Game Design",
	"Category": "Game Design",
	"Age": "9 and up",
	"Time": "Full-day",
	"Prereq": "Familiar with game-making software",
	"Description": "In this course, students learn the fundamentals of 3D game design;  how to create dynamic 3D environments from scratch. Students operate on the X, Y & Z axis, and adjust textures, material and lighting, to design a world of their imagination. Throughout the course, we encourage students to use creativity, while also stressing fundamental principles of 3D game design. At the end of the course, students will have a finished 3D game that they can share with family and friends.",
	"Notes": "Students’  projects and resource files will be available for download 48 hours after the completion of the course.",
	"Status": ""
}, {
	"Title": "Minecraft &reg; Survival",
	"Category": "Minecraft",
	"Age": "8 and up",
	"Time": "Half-day",
	"Prereq": "None",
	"Description": "Students will navigate the Minecraft world, collaborate and communicate with each other to explore, complete quests, strategize and build creations. They will practice digital citizenship, creative thinking, teamwork and problem solving skills. Laptops are networked without internet access so that students can learn and have fun with each other in a safe “cyber” environment. Network, server and application concepts will also be discussed.",
	"Notes": "Students’  projects and resource files will be available for download 48 hours after the completion of the course.",
	"Status": "UPDATED"
}, {
	"Title": "Minecraft &reg; Building Wonders",
	"Category": "Minecraft",
	"Age": "8 and up",
	"Time": "Half-day",
	"Prereq": "Minecraft experience",
	"Description": "Students will learn about some famous monuments in the world. Utilizing various blocks, ores, crafted items, tools, students are challenged to replicate a famous structure and then design their own structure with some real and/or made-up fun facts. Teachers will provide tips and tricks on building better structures in Minecraft. This class maybe taken more than once, because different structure types from different geographical location and/or time period will be discussed.",
	"Notes": "Students’  projects and resource files will be available for download 48 hours after the completion of the course.",
	"Status": ""
}, {
	"Title": "Minecraft &reg; Machine Marvels",
	"Category": "Minecraft",
	"Age": "8 and up",
	"Time": "Half-day",
	"Prereq": "Minecraft experience",
	"Description": "Students will be creating contraptions with items such as pistons, pressure-plates, levels, buttons, trip wire, lava, water, doors, dispenser, TNT and redstone. The teacher will provide guidelines on how to build some simple machines. These simple machines will be connected to create an entertaining “Rube Goldberg” machine. In addition to learning about action and reaction, transfer of energy, this course will also showcase the students’ logical ability as well as creativity.",
	"Notes": "Students’  projects and resource files will be available for download 48 hours after the completion of the course.",
	"Status": ""
}];